Revit 2027 API
ParameterTypeId.BendingDetailTypeSegmentLengthDimensionsForHooksEnabled Property
 "Hook Lengths"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BendingDetailTypeSegmentLengthDimensionsForHooksEnabled { get; }
Public Shared ReadOnly Property BendingDetailTypeSegmentLengthDimensionsForHooksEnabled As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BendingDetailTypeSegmentLengthDimensionsForHooksEnabled {
	ForgeTypeId^ get ();
}
static member BendingDetailTypeSegmentLengthDimensionsForHooksEnabled : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace